<template>
<div>
    <v-app-bar dense fixed>
        <div class="admin-header">
            <div class="admin-title">
              <span class="title-text">天津大学校务系统管理后台</span>
            </div>
            <div class="admin-home" @click="transferURL('/home')">
                <svg  class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2866" width="32" height="32"><path d="M770.133333 917.333333h-140.8c-25.6 0-44.8-19.2-44.8-44.8V618.666667s0-2.133333-2.133333-2.133334h-140.8c-2.133333 0-2.133333 0-2.133333 2.133334v253.866666c0 25.6-19.2 44.8-44.8 44.8h-140.8c-25.6 0-44.8-19.2-44.8-44.8V490.666667s0-2.133333-2.133334-2.133334H151.466667c-19.2 0-36.266667-10.666667-42.666667-29.866666-6.4-17.066667-2.133333-36.266667 12.8-49.066667L482.133333 117.333333c17.066667-14.933333 40.533333-14.933333 57.6 0l360.533334 294.4c14.933333 12.8 19.2 32 12.8 49.066667-6.4 17.066667-23.466667 29.866667-42.666667 29.866667h-53.333333c-2.133333 0-2.133333 0-2.133334 2.133333V874.666667c0 23.466667-19.2 42.666667-44.8 42.666666zM441.6 573.866667h140.8c25.6 0 44.8 19.2 44.8 44.8v253.866666s0 2.133333 2.133333 2.133334h140.8c2.133333 0 2.133333 0 2.133334-2.133334V490.666667c0-25.6 19.2-44.8 44.8-44.8h53.333333s2.133333 0 2.133333-2.133334L514.133333 149.333333h-4.266666L149.333333 443.733333c0 2.133333 2.133333 2.133333 2.133334 2.133334h53.333333c25.6 0 44.8 19.2 44.8 44.8v381.866666s0 2.133333 2.133333 2.133334h140.8c2.133333 0 2.133333 0 2.133334-2.133334V618.666667c2.133333-25.6 21.333333-44.8 46.933333-44.8z" fill="#666666" p-id="2867"></path></svg>
            </div>
            <div class="admin-message" @click="transferURL('/message')">
                <svg  t="1600078896273" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2776" width="32" height="32"><path d="M512.512 844.8c20.992 0 36.864 15.872 36.864 36.864s-15.872 36.864-36.864 36.864-36.864-15.872-36.864-36.864 15.872-36.864 36.864-36.864z m-16.384-665.6c5.632-0.512 10.752 0 16.384 0h7.168c120.832 3.584 215.04 109.568 215.04 232.448v322.56c0 13.312 2.56 25.088 7.168 36.864h-457.728c4.096-11.776 7.168-24.064 7.168-36.864v-332.8c-1.024-117.76 89.6-214.016 204.8-222.208z m16.384-148.48c-40.96 0-74.24 33.28-74.24 74.24 0 3.072 1.024 6.144 1.024 9.216-128 32.768-223.232 148.992-223.232 286.72v332.8c0 20.992-15.872 36.864-36.864 36.864h-36.864v74.24h265.728c-4.096 11.776-7.168 24.064-7.168 36.864 0 60.928 50.176 111.104 111.104 111.104s111.104-50.176 111.104-111.104c0-13.312-2.56-25.088-7.168-36.864h265.728v-74.24h-36.864c-20.992 0-36.864-15.872-36.864-36.864v-322.56c0-139.264-92.672-263.168-223.232-296.96 0.512-3.072 1.024-6.144 1.024-9.216 1.024-40.96-32.256-74.24-73.216-74.24z" p-id="2777"></path></svg>
            </div>
            <div class="admin-logout" @click="logout()">登出</div>
        </div>
    </v-app-bar>
</div>
</template>

<script>
import {
    deleteToken,
    getUser
} from "../utils/cookie.js";
import {
    logout
} from "../api/admin.js";
export default {
    name: "Header",
    methods: {
        logout() {
            var user = getUser();
            logout(user).then(
                () => {
                    deleteToken();
                    this.$router.push('/login');
                }
            )
        },
        transferURL(url){
            this.$router.push(url)
        }
    },


}
</script>

<style scoped>
.admin-header {
    display: flex;
    width: 100%;
}

.admin-title {
    font-size: 24px;
    font-weight: 900;
    color: #1E88E5;
    width: 100%;
    /*text-align: center;*/
    flex: 18;
}

.admin-logout {
    flex: 1;
    text-align: center;
    margin-top: 8px
}

.admin-home{
    flex: 1;
}

.admin-message{
    flex: 1;

}

.admin-home:hover{
    color: #D4E157;
    opacity: 0.5;
}

.admin-logout:hover{
    color: #D4E157;
    opacity: 0.5;
}

.admin-message:hover{
    color: #D4E157;
    opacity: 0.5;
}

.admin-logout:hover {
    color: #E53935;
    font-weight: 900;
    cursor: pointer;
}

.title-text{
  margin-left: 45%;
}
</style>
